{"pages":[{"title":"links","text":"なに，(⊙o⊙)？ ame","link":"/links/index.html"},{"title":"about","text":"Hello! I’m abel. I’m a Master’s student in Computer Science and Technology now. My research focuses on Information Extraction, Knowledge Graph in Natural Language Processing. My research skill is still relatively low now.😅 Thank you for visiting. I have created personal blogs many times before, by myself or using frameworks made by others such as Wordpress, Typecho and Jekyll; However, due to my blind pursuit of dynamic effects, the blog was designed more and more fancy, but the content was more and more empty, and even once the blog was dressed up as a personal love memorial website, making the blog stupid； After a year, I re-build my blog with the encouragement of my friend, the following provisions are made: Only three types of articles will be shared: Summaries of literature in my own research area and related fields; Summaries of techniques accumulated in the course of research, projects and personal practice; Non-regular personal summaries based on todo-list. In the three types of articles: The summary of the literature is required to be understandable and rewarding for those who have relevant research experience. Aka. quality assurance, preferring lack to lack; Technical summaries that I can read and understand, or I can quickly remember when I needs them, but that do not require that others understand the exact meaning; Personal summary requirements to todo-list-based. The blog can be revamped after a certain level of academic or technical achievement in order to “get the details right”; No more fancy plugins, features and pages on top of the current one; I strive to make this blog an accumulative testimony of personal thoughts and techniques, and if I’m busy or have nothing good to offer, I can break off, and perfunctory work is strictly prohibited. Contact me: Github Email","link":"/about/index.html"},{"title":"tags","text":"","link":"/tags/index.html"}],"posts":[{"title":"Todo-List 2023 Spring","text":"Basic schedule from May to September 2023 Jul 1st Week [x] 找到实习 [x] 继续推进研究方向 [ ] 暂停本博客的维护至10月 Jun 4th Week [x] 博客改版 [x] 未来计划确认 3rd Week [x] 正式发布大模型 [x] 读完目前整理的多模态论文 [x] 整理相关的大模型研究进展 [x] 起草训练和部署大模型过程的技术博客 2nd Week [x] 整理并发布至少一篇博客 [x] 完成大模型校园内测版 1st Week [x] 持续进行科研任务 [x] 重新开始阅读和整理文献 [x] 完成前期LeetCode题的整理 May 5th Week [x] 完成大模型的训练部署 [x] 完成分布式系统的期末考试 [x] 正式进入科研+刷题阶段 4th Week [x] 整理和打印分布式系统各项资料 [x] 复习分布式系统，完成应试准备 [x] 基本完成论文代码的修改和运行测验 [x] 基本完成大模型的数据工作、项目的模型收尾工作 3rd Week 这一周真的光玩塞尔达了！！但是太好玩啦！ [x] 塞尔达-王国之泪！！！！！！！！ 2nd Week [x] 完成W2NER的论文笔记 [x] 完成CoT的论文笔记(in 论文合集1) [x] 完成实习项目算法部分的余下全部内容，并完善和修改以前部署的部分 [x] 项目交接 1st Week [x] 完成分布式系统的课件整理和概览 [x] 完成非科研和课业内容的前期杂事 [x] 完成第二版代码的修改和验证性训练","link":"/2023/05/02/Todo-List-2023-Spring/"},{"title":"Something","text":"已经有很长时间没有自我总结过了，可能因为当初决定博客里面不允许出现这些内容的缘故。不过现在已经将技术内容全部迁移到公开博客去了，这个干脆就当作自己生活的记录就好。 科研 今年到目前为止，科研工作一直没有进展，虽然刚开学的时候费力写了很多代码，设计了一套非常优美的图论编码-解码算法，但是实际的效果并没有那么显著，究其原因还是因为这套算法过于理想化；虽然后面我又做了很多改进，但还是有气无力，提升有限。 无奈之下只好做出更换研究方向的决定，但这个决定并不是不理智的： 原方向的多个数据集已经被刷到了95左右的成绩，继续下去意义并不大，很难抓住审稿人的兴趣； 这些数据集构造的并不合理，除开里面存在的大量错误，它的测试集和训练集竟然有高达89%的重合，那么无论模型结构或者训练方法如何的创新，在这里做的也只是不断刷新“过拟合”的点罢了； 这个小方向做的多是国人，而且并不多，算不上什么对学界或业界有特别大贡献的方向，很难走得更远； 虽然我也想过自己造数据集，可惜费时费力不说，还人微言轻，发了其他同行也不一定认；也打算从ACE数据中进行拆分，可惜ACE高昂的使用费我难以承担 做出换方向的决定已经有半个月了，新方向的文献也看了不少了，甚至有了直接复现新方向文献代码的能力，然而受限于阅读量，即没有建立起一个完善的，针对该方向的方法技术体系，也没能涌现出新的想法。 看来接下来的两三个月时间，必须继续坚持不屑的学习啊，希望去年被顶会拒掉的遗憾，这次能够被弥补上。 工作 3月份开始为某研究院做算法，这实在让人头疼，一开始还算合理，给数据，讲需求，很快我就完成了算法的设计，实现了性能147%的提升，得到了研究院的一致认可。 但后续的操作就开始离谱了，不给数据也不告诉我具体场景，就要我给算法，甚至还说想要一个万能的模型。 实在不理解甲方的无理要求，所以干脆就退居二线，只做顾问，好在工资照发。 除了这个外，还有一个比较有意义的事就是大模型。 我从头到尾参与了整个过程，甚至连宣传文案和排版都是我写，但是也有了很多收获。以往对大模型的感受仅仅是使用体验上的，而在这个过程中，我们调研了大量的模型，除了CloseAI外，其他模型的核心技术基本上都知道了。 现在对于训练大模型的 数据构造、数据配比、模型底座选择、训练周期、训练成本、并行和分布式问题等多个方面都有了更深入的认识，并且也得到了大量的转发。 就在前几天，被新华社采访后，已经有了100多万的点击量了。 不过涉及训练的细节的东西就不能在这里写了。 生活 我并不想过多的使用父母的钱，所以本科的mac和iPhone都是自己花钱买的，用光了积蓄。然而本科四年并没有收入，谈恋爱大部分时候只能去看电影和吃饭，对于幻想中的旅行，也只能存在于幻想中了。 如今研究生有了比较可观的收入了，可以去做各种幻想中的事情了，可以花一段时间无忧无虑地度假了，才发现没有任何人喜欢我。 而受到上一段感情背叛造成的阴影，我没能也不敢去接触任何新的异性，所以只能每天在实验室里对着屏幕，或者独自一人走在炎热的路上。 有的时候在想，我这辈子可能不会再有什么恋爱的说法了，顶多就是以后相亲吧，找一个生意伙伴共同经营家庭，毫无感情基础，只有一些琐碎来维持。 作为马克思主义者，我当然知道婚姻的意义是什么，可是身处这个时代，我也只能将自己交给时代。 我不知道她现在的生活怎么样了，说实话我是比较后悔当初做的事情的，在她提出分手后我就应该直接答应并完全切断一切联系途径，但我却不断关注，直到发现她分手只是因为背叛。这样一颗痛苦且怨恨的种子一直在脑海中生长，以致于我不想相信任何基于爱慕的感情。 一切甜蜜的对白都是欺骗，一切坚实的承诺都是虚伪，一切深刻的回忆都是美化，一切走不出的痛苦都是自残。 所以，我前所未有的关注美食、关注娱乐、关注我亲爱的家人、关注我友好的朋友、关注充满挑战的学术、关注世间一切的美好，唯独将男欢女爱当作同所有浑浊的事般，以爱慕行苟且的大言不惭。","link":"/2023/07/08/Something/"}],"tags":[{"name":"todo-list","slug":"todo-list","link":"/tags/todo-list/"},{"name":"Diary","slug":"Diary","link":"/tags/Diary/"}],"categories":[]}